RDVMI.rdvmi-ext/src/Enums/рдв_ТипыВыгружаемыхОбъектов/рдв_ТипыВыгружаемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ТипыВыгружаемыхОбъектов</name>
  <enumValues>
    <name>Ссылка</name>
  </enumValues>
  <enumValues>
    <name>НаборЗаписей</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Enums/рдв_НаправленияСообщенийИнтеграции/рдв_НаправленияСообщенийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_НаправленияСообщенийИнтеграции</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Catalogs/рдв_ВнешниеСистемы/рдв_ВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_ВнешниеСистемы</name>
  <predefined>
    <items>
      <name>рдв_Демо</name>
      <description>Демо (РДВ)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.рдв_ТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТокенАвторизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяРегламента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RDVMI.rdvmi-ext/src/CommonModules/рдв_МодульИнтеграцииДемо/Module.bsl
#Область МенеджерОбмена

Процедура ЗаполнитьПравилаКонвертацииОбъектов(СвойстваКонвертации, НаправлениеОбмена) Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;
	
	Если НаправлениеОбмена = "Отправка" Тогда
	
		ДобавитьПКО_Справочник_Контрагенты(СвойстваКонвертации);			
		ДобавитьПКО_Справочник_Партнеры(СвойстваКонвертации);			
		ДобавитьПКО_РегистрСведений_КурсыВалют(СвойстваКонвертации);			
		ДобавитьПКО_Справочник_Валюты(СвойстваКонвертации);			
		ДобавитьПКО_Справочник_Кассы_Отправка(СвойстваКонвертации);			
		ДобавитьПКО_Справочник_Организации(СвойстваКонвертации);			
 		ДобавитьПКО_Документ_ЗаказПокупателя(СвойстваКонвертации);			

	Иначе
		
		ДобавитьПКО_Справочник_Контрагенты(СвойстваКонвертации);			
		ДобавитьПКО_РегистрСведений_КурсыВалют(СвойстваКонвертации);			
		ДобавитьПКО_Справочник_Кассы_Получение(СвойстваКонвертации);			
		ДобавитьПКО_Справочник_КассыККМ_Получение(СвойстваКонвертации);			
 		ДобавитьПКО_Справочник_Организации(СвойстваКонвертации);			
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередВыгрузкойОбъекта(ДанныеИБ, ПКО, Отказ) Экспорт

	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеИБ.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка И
		ТипЗнч(ДанныеИБ.СсылкаНаОбъект) = Тип("ДокументСсылка._ДемоЗаказПокупателя") Тогда
		КодОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.СсылкаНаОбъект, "Организация.Код");
		Если КодОрганизации = "000000002" Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыгрузкеСсылки(Ссылка, ВыгружаемыеДанные) Экспорт

	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Пользователи") 
		И ЗначениеЗаполнено(Ссылка) Тогда
		ИмяПользователяИБ = РассылкаОтчетов.ИмяПользователяИБ(Ссылка);
		ВыгружаемыеДанные.Вставить("ИмяПользователяИБ", ИмяПользователяИБ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьСвойстваЗагружаемогоОбъекта(СвойстваЗагружаемогоОбъекта) Экспорт

	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	Если СвойстваЗагружаемогоОбъекта.ЗагружаемыеДанные._ТипЗначения = "Документ._ДемоЗаказПокупателя" Тогда
		Если СвойстваЗагружаемогоОбъекта.ЗагружаемыеДанные.Организация.ИНН = "7814512138" Тогда
			СвойстваЗагружаемогоОбъекта.МенеджерОбъекта = Документы._ДемоРеализацияТоваров;
			СвойстваЗагружаемогоОбъекта.ПКО = рдв_МенеджерОбмена.ПравилаКонвертацииПоИмениПКО("Документ_ДемоРеализацияТоваров", "Получение");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция НайтиСсылкуНаОбъект(ЗагружаемыеДанные, СвойстваЗагружаемогоОбъекта) Экспорт

	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат Неопределено;
	КонецЕсли;

	//Если ЗагружаемыеДанные._ИмяОбъекта = "Справочник.Контрагенты" Тогда;
	//	Если ЗагружаемыеДанные.Свойство("ИНН") И ЗагружаемыеДанные.Свойство("КПП") Тогда
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	_ДемоКонтрагенты.Ссылка КАК Ссылка
	//		|ИЗ
	//		|	Справочник._ДемоКонтрагенты КАК _ДемоКонтрагенты
	//		|ГДЕ
	//		|	_ДемоКонтрагенты.ИНН = &ИНН
	//		|	И _ДемоКонтрагенты.КПП = &КПП";
	//		Запрос.УстановитьПараметр("ИНН", ЗагружаемыеДанные.ИНН);
	//		Запрос.УстановитьПараметр("КПП", ЗагружаемыеДанные.КПП);
	//		Результат = Запрос.Выполнить();
	//		Если Не Результат.Пустой() Тогда
	//			Выборка = Результат.Выбрать();
	//			Выборка.Следующий();
	//			Возврат Выборка.Ссылка;
	//		КонецЕсли;
	//	Иначе
	//		Возврат Справочники._ДемоКонтрагенты.НайтиПоНаименованию(ЗагружаемыеДанные.Наименование);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецФункции

Функция ИмяИБ() Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат "RDV1";	
	
КонецФункции

#Область ПКО
Процедура ДобавитьПКО_Справочник_Контрагенты(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоКонтрагенты);
	ПКО.ИмяОбъекта = "Справочник.Контрагенты";
	ПКО.ИмяПКО = "Справочник_Контрагенты";

	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Код", "Код", Истина);
	ДобавитьПКС(КонвертацияШапки, "Партнер", "Партнер",,"Справочник_Партнеры");
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование");
	ДобавитьПКС(КонвертацияШапки, "ВидКонтрагента", "рдв_ВидКонтрагента");

	ТаблЧасть = ДобавитьТаблЧасть(СвойстваКонвертации, ПКО, "КонтактнаяИнформация", "КонтактнаяИнформация");
	ДобавитьПКС(ТаблЧасть, "Тип", "Тип");
	ДобавитьПКС(ТаблЧасть, "Вид", "Вид");
	ДобавитьПКС(ТаблЧасть, "Представление", "Представление");
	
	ПоляПоиска = ПКО.ПоляПоиска;
	ДобавитьПоляПоиска(ПоляПоиска, "Код");
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Партнеры(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоПартнеры);
	ПКО.ИмяОбъекта = "Справочник.Партнеры";
	ПКО.ИмяПКО = "Справочник_Партнеры";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Код", "Код", Истина);
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_РегистрСведений_КурсыВалют(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.РегистрыСведений.КурсыВалют);
	ПКО.ИмяОбъекта = "РегистрСведений.КурсыВалют";
	ПКО.ИмяПКО = "РегистрСведений_КурсыВалют";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Валюта", "Валюта", Истина, "Справочник_Валюты");
	ДобавитьПКС(КонвертацияШапки, "Период", "Период");
	ДобавитьПКС(КонвертацияШапки, "Курс", "Курс", Истина);
	ДобавитьПКС(КонвертацияШапки, "Кратность", "Кратность", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Валюты(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники.Валюты);
	ПКО.ИмяОбъекта = "Справочник.Валюты";
	ПКО.ИмяПКО = "Справочник_Валюты";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Код", "Код", Истина);
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Кассы_Отправка(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоКассы);
	ПКО.ИмяОбъекта = "Справочник.Кассы";
	ПКО.ИмяПКО = "Справочник_Кассы";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Владелец", "Владелец",,"Справочник_Организации");
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Кассы_Получение(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоКассы);
	ПКО.ИмяОбъекта = "Справочник.Кассы";
	ПКО.ИмяПКО = "Справочник_Кассы";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Владелец", "Владелец",,"Справочник_Организации");
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_КассыККМ_Получение(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоКассыККМ);
	ПКО.ИмяОбъекта = "Справочник.Кассы";
	ПКО.ИмяПКО = "Справочник_КассыККМ";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Владелец", "Владелец",,"Справочник_Организации");
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Организации(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоОрганизации);
	ПКО.ИмяОбъекта = "Справочник.Организации";
	ПКО.ИмяПКО = "Справочник_Организации";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Код", "Код", Истина);
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

Процедура ДобавитьПКО_Документ_ЗаказПокупателя(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Документы._ДемоЗаказПокупателя);
	ПКО.ИмяОбъекта = "Документ.ЗаказПокупателя";
	ПКО.ИмяПКО = "Документ_ЗаказПокупателя";
	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Номер", "Номер", Истина);
	ДобавитьПКС(КонвертацияШапки, "Дата", "Дата", Истина);
	ДобавитьПКС(КонвертацияШапки, "Контрагент", "Контрагент",, "Справочник_Контрагенты");
	ДобавитьПКС(КонвертацияШапки, "Ответственный", "Ответственный",, "Справочник_Пользователи");
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Пользователи(СвойстваКонвертации)

	ПКО = ДобавитьПКО(СвойстваКонвертации, Метаданные.Справочники._ДемоКонтрагенты);
	ПКО.ИмяОбъекта = "Справочник.Пользователи";
	ПКО.ИмяПКО = "Справочник_Пользователи";

	КонвертацияШапки = ПКО.КонвертацияШапки;
	ДобавитьПКС(КонвертацияШапки, "Наименование", "Наименование", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции
// см. рдв_МенеджерОбмена.ДобавитьПКО
Функция ДобавитьПКО(СвойстваКонвертации, МетаданныеОбъекта) 
	
	Возврат рдв_МенеджерОбмена.ДобавитьПКО(СвойстваКонвертации, МетаданныеОбъекта);
	
КонецФункции

//см. рдв_МенеджерОбмена.ДобавитьПКС
Функция ДобавитьПКС(Свойства, ИмяРеквизита, ИмяКлючаФормата = "", Обязательный = Ложь, ИмяПКО = "")
	
	Возврат рдв_МенеджерОбмена.ДобавитьПКС(Свойства, ИмяРеквизита, ИмяКлючаФормата, Обязательный, ИмяПКО);
	
КонецФункции

//см. рдв_МенеджерОбмена.ДобавитьТаблЧасть
Функция ДобавитьТаблЧасть(СвойстваКонвертации, ПКО, ИмяТаблЧасти, ИмяКлючаФормата = "")
	
	Возврат рдв_МенеджерОбмена.ДобавитьТаблЧасть(СвойстваКонвертации, ПКО, ИмяТаблЧасти, ИмяКлючаФормата);
	
КонецФункции

//см. рдв_МенеджерОбмена.ДобавитьПоляПоиска
Процедура ДобавитьПоляПоиска(ПоляПоиска, СписокПолейПоиска)
	
	рдв_МенеджерОбмена.ДобавитьПоляПоиска(ПоляПоиска, СписокПолейПоиска);
	
КонецПроцедуры
#КонецОбласти 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт

	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);
		
	Если ТипИсточника = Тип("СправочникОбъект._ДемоКонтрагенты") Тогда
		//рдв_РаботаСОчередями.ДобавитьВОчередь("РегистрацияКонтрагентов", Источник.Ссылка);
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.рдв_СообщенияИнтеграции") Тогда
		Если Источник.Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее Тогда
			рдв_РаботаСОчередями.ДобавитьВОчередь("ОбработкаВходящихСообщений", Источник.Ссылка);
		КонецЕсли;
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект._ДемоКассы") Тогда
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект._ДемоРасходныйКассовыйОрдер") Тогда
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументОбъект._ДемоЗаказПокупателя") Тогда
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	КонецЕсли;

КонецПроцедуры

Процедура НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);
  	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.КурсыВалют") Тогда
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССервисами

Процедура ОбработатьВходящийЗапрос(ДанныеСервиса, ДанныеЗапроса, Ответ) Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	Ответ = Истина;
	
КонецПроцедуры

Функция ПараметрыСервисаHTTP() Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеИнтерфейса = Новый Структура("ИмяИнтерфейса, ПредставлениеИнтерфейса");
	ОписаниеИнтерфейса.ИмяИнтерфейса = "рдв_Демо";
	ОписаниеИнтерфейса.ПредставлениеИнтерфейса = НСтр("ru = 'Демо (РДВ)'");
	Интерфейс = Справочники.рдв_ИнтерфейсыИнтеграции.ПолучитьИнтерфейс(ОписаниеИнтерфейса);

	ВидСообщения = Справочники.рдв_ВидыСообщенийИнтеграции.ПолучитьВидСообщения(Интерфейс, "exchange");
	
	ПараметрыСервиса = Новый Структура("Интерфейс, ВидСообщения, СтандартнаяСтруктураЗапроса", Интерфейс, ВидСообщения, Истина);
	
	Возврат ПараметрыСервиса;
		
КонецФункции

#КонецОбласти

#Область РегистрацияИзменений

Процедура ЗаполнитьПравилаРегистрации(ПравилаРегистрации) Экспорт
		
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат;
	КонецЕсли;

	RMQ = Справочники.рдв_ВнешниеСистемы.НайтиПоНаименованию("RMQ");
	HTTP = Справочники.рдв_ВнешниеСистемы.НайтиПоНаименованию("Демо (РДВ)");
	
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Справочники._ДемоКонтрагенты, 
								RMQ, 
								"RMQ",
								"RMQ",
								"exchange",
								"Контрагенты");


	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Справочники._ДемоКонтрагенты, 
								HTTP, 
								"Демо (РДВ)",
								"Демо (РДВ)",
								"exchange",
								"Контрагенты");
							
								
								
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.РегистрыСведений.КурсыВалют, 
								RMQ, 
								"RMQ",
								"RMQ",
								"exchange",
								"КурсыВалют");

								
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Справочники._ДемоКассы, 
								RMQ, 
								"RMQ",
								"RMQ",
								"exchange",
								"Кассы");

								
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Документы._ДемоЗаказПокупателя, 
								RMQ, 
								"RMQ",
								"RMQ",
								"exchange",
								"ЗаказПокупателя");
								
КонецПроцедуры

Процедура ДобавитьПравилоРегистрации(ПравилаРегистрации, 
										МетаданныеОбъекта, 
										ВнешняяСистема, 
										ИмяИнтерфейса = "", 
										ПредставлениеИнтерфейса = "", 
										АдресМетода = "", 
										ИмяВидаСообщения = "")

										
	Интерфейс = Неопределено;
	ВидСообщения = Неопределено;

	Если ЗначениеЗаполнено(ИмяИнтерфейса) Тогда
		ПараметрыСервиса = Новый Структура("ИмяИнтерфейса, ПредставлениеИнтерфейса", ИмяИнтерфейса, ПредставлениеИнтерфейса);
		ДанныеСервиса = Новый Структура("ПараметрыСервиса", ПараметрыСервиса);
		Интерфейс = Справочники.рдв_ИнтерфейсыИнтеграции.ПолучитьИнтерфейс(ПараметрыСервиса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВидаСообщения) И ЗначениеЗаполнено(Интерфейс) Тогда
		ВидСообщения = Справочники.рдв_ВидыСообщенийИнтеграции.ПолучитьВидСообщения(Интерфейс, ИмяВидаСообщения);
	КонецЕсли;
											
	ПравилоРегистрации = ПравилаРегистрации.Добавить();
	ПравилоРегистрации.МетаданныеОбъекта = МетаданныеОбъекта;
	ПравилоРегистрации.ВнешняяСистема = ВнешняяСистема;
	ПравилоРегистрации.Интерфейс = Интерфейс;
	ПравилоРегистрации.АдресМетода = АдресМетода;
	ПравилоРегистрации.ВидСообщения = ВидСообщения;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСRMQ

Функция ПараметрыСервисаRMQ() Экспорт
	
	Если Не рдв_МодульИнтеграцииДемоПовтИсп.ЭтоДемоБаза() Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИмяИнтерфейса = "RMQ";
	ПредставлениеИнтерфейса = НСтр("ru = 'RMQ'");
	
	Параметры = рдв_РаботаССервисами.ПараметрыСервиса(ИмяИнтерфейса, ПредставлениеИнтерфейса);
	
	Возврат Параметры;
		
КонецФункции

Процедура ЗаполнитьДанныеСервисаRMQПолучение(ДанныеСервиса, Результат) Экспорт

	ОписаниеИнтерфейса = Новый Структура("ИмяИнтерфейса, ПредставлениеИнтерфейса");
	ОписаниеИнтерфейса.ИмяИнтерфейса = "RMQ";
	ОписаниеИнтерфейса.ПредставлениеИнтерфейса = "RMQ";
	Интерфейс = Справочники.рдв_ИнтерфейсыИнтеграции.ПолучитьИнтерфейс(ОписаниеИнтерфейса);
	ДанныеСервиса.Вставить("Интерфейс", Интерфейс);
	
	ВидСообщения = Справочники.рдв_ВидыСообщенийИнтеграции.ПолучитьВидСообщения(Интерфейс, Результат.КлючМаршрутизации);
	ДанныеСервиса.Вставить("ВидСообщения", ВидСообщения);
	
	
КонецПроцедуры

#КонецОбласти
